
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
* Delete
  * azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY will be destroyed
  # (because azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY is not in configuration)
  - resource "azurerm_key_vault_secret" "AZURE_APPINSGHTS_KEY" {
      - id                      = "https://aac-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/204db1485b3342d593a3ac4442b44a17" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/aac-manage-case-assignment-aat/providers/Microsoft.KeyVault/vaults/aac-aat" -> null
      - name                    = "AppInsightsInstrumentationKey" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/aac-manage-case-assignment-aat/providers/Microsoft.KeyVault/vaults/aac-aat/secrets/AppInsightsInstrumentationKey/versions/204db1485b3342d593a3ac4442b44a17" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/aac-manage-case-assignment-aat/providers/Microsoft.KeyVault/vaults/aac-aat/secrets/AppInsightsInstrumentationKey" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - value_wo_version        = 0 -> null
      - version                 = "204db1485b3342d593a3ac4442b44a17" -> null
      - versionless_id          = "https://aac-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey" -> null

      - timeouts {}
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/aac-manage-case-assignment-aat/providers/Microsoft.KeyVault/vaults/aac-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":570,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->